org/pytype.org
#+TITLE: Python's Type theory
#+options: toc:2 H:2
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
#+subtitle: =Python -> Tuple[TypeTheory, typing]=
#+subtitle: [[file:index.org][Home]]

* Context
** Opening remarks
  Python added support for type hints in the =typing= module in Python
  version 3.5.  Use this for:
  - adding type hints (think of these as a *very* powerful form of
    adding comments to your code).
  - static typechecking (by an external tool like =mypy=).
  - typechecking within an IDE (many editors and IDEs do this on the fly).
  - a sanity check (to ensure that the code you are writing makes
    sense even without running it).

  Two key points to remember:
  - type hints are an optional feature of python. So, it is not
    necessary that we add type hints to every single line of code.
  - type hints are ignored during runtime and do not affect
    performance of the code.

  Using type hints is optional. But I have found it to be an extremely
  useful feature. I frequently find myself wishing for more features
  in the typing module -- not less.

  These are just my notes on Python's type thoery. Do not use it as a
  fool-proof reference. For proper documentation, one can refer to
  [[https://docs.python.org/3/library/typing.html][typing module docs]] or [[https://www.python.org/dev/peps/pep-0483/][PEP 483]].

** Types vs Types
  There are two meanings for types in python now.  One is the type of
  an object that is returned by calling the in-built =type()=
  function.  The other is the type inferred by an external typechecker
  like =mypy=, and which can be displayed using the =reveal_type=
  function and then running the script through =mypy=.
  
  We will always refer to the second interpretation when we refer to
  the type of an object.

** So, what is type theory?
  Think of it as the math/rules that govern these types.  A basic fact
  to understand it that /every/ python object has a type, whether we
  specify it to the type-checker or not.

* Types that are in-built in python
  Python comes with some in-built types.
  
  #+NAME: built-in types
  #+BEGIN_SRC python :results output
  a: int   = 1
  b: float = 1.0
  c: str   = 'one'
  d: bool  = True
  e: None  = None
  #+END_SRC


  In addition, for every class that we define, we can refer to the
  type of its instances using the name of the class itself.
  #+NAME: classes are Types.
  #+BEGIN_SRC python :results output
  class MyClass:
      pass
  m: MyClass = MyClass()
  #+END_SRC

** Subtypes and NewType
   So far, we have talked about types without specifically defining
   what a type is. We will continue to *not* define them. However, we
   will say that one way to think about a type is simply as a set of
   values (sometimes these values are called terms, or even
   instances). So, =bool= can be thought of as the set ={True,
   False}=, and =int= can be thought of as ={1, 2, 3, ...}=, and so
   on.

   This analogy is also handy when trying to understand Subtypes. A
   type =A= is a subtype of a type =B= if the set of values
   corresponding to =A= is a subset of the set of values corresponding
   to =B=. This is often written (in type-theory texts, but not in
   python itself) as =A <: B=.

   For example, =int <: float=. In other words, every =int= is also a
   =float=.  It may come as a surprise to some python users that in
   python, the following is also true: =bool <: int=.  This is because
   =bool= inherits from =int= and =False=, =True= are just aliases of
   =0= and =1= respectively.

   The =typing= library lets us define subtypes using the =NewType=
   function as follows:

  #+NAME: positive integers
  #+BEGIN_SRC python :results output
  # define a new type
  PositiveInt = NewType('PositiveInt', int)  # This is the same as declaring PositiveInt <: int
  
  # define a constructor function for the new type
  def make_positive_int(a: int) -> PositiveInt:
      if a > 0:
          return PositiveInt(a)
      raise ValueError, 'arg was not positive.'
  #+END_SRC


