pytype.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-22 Sun 22:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python's Type theory</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Vaibhav Karve" />
<link rel="stylesheet" type="text/css" href="css/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Python's Type theory
<br />
<span class="subtitle"><code>Python -&gt; Tuple[TypeTheory, typing]</code> <a href="index.html">Home</a></span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbb511c4">1. Context</a>
<ul>
<li><a href="#orga607029">1.1. Opening remarks</a></li>
<li><a href="#orgc1de000">1.2. Types vs Types</a></li>
<li><a href="#org1f87ebf">1.3. So, what is type theory?</a></li>
</ul>
</li>
<li><a href="#org6254b39">2. Types that are in-built in python</a>
<ul>
<li><a href="#org1d38087">2.1. Subtypes and NewType</a></li>
<li><a href="#orgd8a2671">2.2. Why use <code>NewType</code>?</a></li>
<li><a href="#org9d9a628">2.3. Type coercion</a></li>
</ul>
</li>
<li><a href="#org5c50d5c">3. Importing more Types</a>
<ul>
<li><a href="#org8971e56">3.1. Basic data-structures</a></li>
<li><a href="#org82bf031">3.2. Understanding <code>Any</code></a></li>
<li><a href="#org6c311e4">3.3. Optional and Union</a></li>
<li><a href="#org8cb49a4">3.4. The <code>cast</code> function</a></li>
</ul>
</li>
<li><a href="#org3ff5f1b">4. <span class="todo TODO">TODO</span> Function types</a>
<ul>
<li><a href="#org8a6394c">4.1. Call signatures for functions</a></li>
<li><a href="#org34bc49f">4.2. Callable</a></li>
<li><a href="#org71d5ce7">4.3. Map, reduce, filter</a></li>
<li><a href="#org3a866fc">4.4. Polymosphism via single-dispatch a.k.a. overloaded functions</a></li>
</ul>
</li>
<li><a href="#org4026340">5. <span class="todo TODO">TODO</span> Other special types</a>
<ul>
<li><a href="#org59141d6">5.1. Literal</a></li>
<li><a href="#org953d2c3">5.2. Final</a></li>
<li><a href="#orgb09ea8d">5.3. NamedTuple</a></li>
<li><a href="#org11162e9">5.4. Counter</a></li>
<li><a href="#org1ccd043">5.5. IO</a></li>
</ul>
</li>
<li><a href="#org4f87c9a">6. <span class="todo TODO">TODO</span> Type classes</a>
<ul>
<li><a href="#org32f6279">6.1. Iterator</a></li>
<li><a href="#orgb240b28">6.2. Sized</a></li>
<li><a href="#orge2f5155">6.3. Generator</a></li>
<li><a href="#org772d4bd">6.4. Iterable</a></li>
<li><a href="#org17e43b4">6.5. Collection</a></li>
<li><a href="#org3c776a7">6.6. AbstractSet</a></li>
</ul>
</li>
<li><a href="#orgf27c2cc">7. <span class="todo TODO">TODO</span> Generic Types</a>
<ul>
<li><a href="#org3d43ff3">7.1. Covariant and contravariant types</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbb511c4" class="outline-2">
<h2 id="orgbb511c4"><span class="section-number-2">1</span> Context</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orga607029" class="outline-3">
<h3 id="orga607029"><span class="section-number-3">1.1</span> Opening remarks</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Python added support for type hints in the <code>typing</code> module in Python
version 3.5.  Use this for:
</p>
<ul class="org-ul">
<li>adding type hints (think of these as a <b>very</b> powerful form of
adding comments to your code).</li>
<li>static typechecking (by an external tool like <code>mypy</code>).</li>
<li>typechecking within an IDE (many editors and IDEs do this on the fly).</li>
<li>a sanity check (to ensure that the code you are writing makes
sense even without running it).</li>
</ul>

<p>
Two key points to remember:
</p>
<ul class="org-ul">
<li>type hints are an optional feature of python. So, it is not
necessary that we add type hints to every single line of code.</li>
<li>type hints are ignored during runtime and do not affect
performance of the code.</li>
</ul>

<p>
Using type hints is optional. But I have found it to be an extremely
useful feature. I frequently find myself wishing for more features
in the typing module &#x2013; not less.
</p>

<p>
These are just my notes on Python's type thoery. Do not use it as a
fool-proof reference. For proper documentation, one can refer to
<a href="https://docs.python.org/3/library/typing.html">typing module docs</a> or <a href="https://www.python.org/dev/peps/pep-0483/">PEP 483</a>.
</p>
</div>
</div>

<div id="outline-container-orgc1de000" class="outline-3">
<h3 id="orgc1de000"><span class="section-number-3">1.2</span> Types vs Types</h3>
<div class="outline-text-3" id="text-1-2">
<p>
There are two meanings for types in python now.  One is the type of
an object that is returned by calling the in-built <code>type()</code>
function.  The other is the type inferred by an external typechecker
like <code>mypy</code>, and which can be displayed using the <code>reveal_type</code>
function and then running the script through <code>mypy</code>.
</p>

<p>
We will always refer to the second interpretation when we refer to
the type of an object.
</p>
</div>
</div>

<div id="outline-container-org1f87ebf" class="outline-3">
<h3 id="org1f87ebf"><span class="section-number-3">1.3</span> So, what is type theory?</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Think of it as the math/rules that govern these types.  A basic fact
to understand it that <i>every</i> python object has a type, whether we
specify it to the type-checker or not.
</p>
</div>
</div>
</div>

<div id="outline-container-org6254b39" class="outline-2">
<h2 id="org6254b39"><span class="section-number-2">2</span> Types that are in-built in python</h2>
<div class="outline-text-2" id="text-2">
<p>
Python comes with some in-built types.
</p>

<div class="org-src-container">
<pre class="src src-python" id="org97e1291">a: <span class="org-builtin">int</span>   = 1
b: <span class="org-builtin">float</span> = 1.0
c: <span class="org-builtin">str</span>   = <span class="org-string">'one'</span>
d: <span class="org-builtin">bool</span>  = <span class="org-constant">True</span>
e: <span class="org-constant">None</span>  = <span class="org-constant">None</span>
</pre>
</div>


<p>
In addition, for every class that we define, we can refer to the
type of its instances using the name of the class itself.
</p>
<div class="org-src-container">
<pre class="src src-python" id="org7d532fc"><span class="org-keyword">class</span> <span class="org-type">MyClass</span>:
    <span class="org-keyword">pass</span>
m: <span class="org-variable-name">MyClass</span> = MyClass()
</pre>
</div>
</div>

<div id="outline-container-org1d38087" class="outline-3">
<h3 id="org1d38087"><span class="section-number-3">2.1</span> Subtypes and NewType</h3>
<div class="outline-text-3" id="text-2-1">
<p>
So far, we have talked about types without specifically defining
what a type is. We will continue to <b>not</b> define them. However, we
will say that one way to think about a type is simply as a set of
values (sometimes these values are called terms, or even
instances). So, <code>bool</code> can be thought of as the set <code>{True,
   False}</code>, and <code>int</code> can be thought of as <code>{1, 2, 3, ...}</code>, and so
on.
</p>

<p>
This analogy is also handy when trying to understand Subtypes. A
type <code>A</code> is a subtype of a type <code>B</code> if the set of values
corresponding to <code>A</code> is a subset of the set of values corresponding
to <code>B</code>. This is often written (in type-theory texts, but not in
python itself) as <code>A &lt;: B</code>.
</p>

<p>
For example, <code>int &lt;: float</code>. In other words, every <code>int</code> is also a
<code>float</code>.  It may come as a surprise to some python users that in
python, the following is also true: <code>bool &lt;: int</code>.  This is because
<code>bool</code> inherits from <code>int</code> and <code>False</code>, <code>True</code> are just aliases of
<code>0</code> and <code>1</code> respectively.
</p>

<p>
The <code>typing</code> library lets us define subtypes using the <code>NewType</code>
function as follows:
</p>

<div class="org-src-container">
<pre class="src src-python" id="org662582f"><span class="org-comment-delimiter"># </span><span class="org-comment">define a new type</span>
<span class="org-variable-name">PositiveInt</span> = NewType(<span class="org-string">'PositiveInt'</span>, <span class="org-builtin">int</span>)  <span class="org-comment-delimiter"># </span><span class="org-comment">This is the same as declaring PositiveInt &lt;: int</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">define a constructor function for the new type</span>
<span class="org-keyword">def</span> <span class="org-function-name">make_positive_int</span>(a: <span class="org-builtin">int</span>) -&gt; PositiveInt:
    <span class="org-keyword">if</span> a &gt; 0:
        <span class="org-keyword">return</span> PositiveInt(a)
    <span class="org-keyword">raise</span> <span class="org-type">ValueError</span>, <span class="org-string">'arg was not positive.'</span>
</pre>
</div>
</div>
</div>
