pytype.html


<div id="outline-container-orgd8a2671" class="outline-3">
<h3 id="orgd8a2671"><span class="section-number-3">2.2</span> Why use <code>NewType</code>?</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<code>NewType</code> offers a way to restrict the type of argument supplied
to a function. Looking at the example above, we can see that
<code>PositiveInt</code> is a subtype of <code>int</code>. This means that a function
that accepts an <code>int</code> argument will also accept an argument of
type <code>PositiveInt</code> without any hiccups. However, a function that
accepts <code>PositiveInt</code> as an argument will not accept any
run-of-the-mill <code>int</code> as its input (here, by "would not accept" we
mean that such an argument will not pass through the typechecker
without an error).
</p>

<p>
Our constructor function <code>make_positive_int</code> ensures that the only
way to create a <code>PositiveInt</code> is to pass it through this
function.
</p>

<p>
This subtype and its constructor can then be used to create safer
functions that only accept the restricted type. For example, we
can have:
</p>

<div class="org-src-container">
<pre class="src src-python" id="orgb6b92e6"><span class="org-comment-delimiter"># </span><span class="org-comment">define a new type</span>
<span class="org-keyword">from</span> math <span class="org-keyword">import</span> log

<span class="org-keyword">def</span> <span class="org-function-name">safe_logarithm</span>(p: PositiveInt) -&gt; <span class="org-builtin">float</span>:
    <span class="org-keyword">return</span> math.log(p)

safe_log(-5)  <span class="org-comment-delimiter"># </span><span class="org-comment">Fails in typechecking as well as in runtime</span>
safe_log(5)   <span class="org-comment-delimiter"># </span><span class="org-comment">Fails in typechecking only. Computes correctly at runtime.</span>

safe_log(make_positive_int(-5))  <span class="org-comment-delimiter"># </span><span class="org-comment">Passes typecking. Raises ValueError and meaningful error message at runtime.</span>
safe_log(make_positive_int(5))   <span class="org-comment-delimiter"># </span><span class="org-comment">Passes typechecking. Computes correctly at runtime.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9d9a628" class="outline-3">
<h3 id="org9d9a628"><span class="section-number-3">2.3</span> Type coercion</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Type coercion refers to the process by which the typechecker
changes the type of some of the variables to match function call
signatures.
</p>

<div class="org-src-container">
<pre class="src src-python" id="org027c9b1">a: <span class="org-builtin">int</span>   = 2
b: <span class="org-builtin">float</span> = 3.0
<span class="org-variable-name">c</span> = a + b
</pre>
</div>

<p>
In the above code example, if we ask the typechecker for the type of
<code>c</code>, then it will correctly guess that <code>c</code> is a <code>float</code>. How did it
reach that conclusion? The answer is that the <code>+</code> operator is
overloaded (details on how to write overloaded functions are given
in a later section). Since one of the arguments is a <code>float</code>, python
<i>coerces</i> <code>a</code> from an <code>int</code> into a <code>float</code> and then computes the sum
of two <code>float</code>'s (which is also obviously a <code>float</code>).
</p>

<p>
In general, typecheckers coerce type <code>A</code> into type <code>B</code> (if required)
whenever they know that <code>A</code> is a subtype of <code>B</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-org5c50d5c" class="outline-2">
<h2 id="org5c50d5c"><span class="section-number-2">3</span> Importing more Types</h2>
<div class="outline-text-2" id="text-3">
<p>
By importing from <code>typing</code>, we get access to some more types.
</p>
</div>

<div id="outline-container-org8971e56" class="outline-3">
<h3 id="org8971e56"><span class="section-number-3">3.1</span> Basic data-structures</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-python" id="org687700f"><span class="org-keyword">from</span> typing <span class="org-keyword">import</span> (Any, Dict, FrozenSet, List, Set, Tuple)

a:  <span class="org-variable-name">List</span>[<span class="org-builtin">int</span>]      = [1, 2]
b:  <span class="org-variable-name">List</span>[<span class="org-builtin">str</span>]      = [<span class="org-string">'one'</span>, <span class="org-string">'two'</span>]
c:  <span class="org-variable-name">Dict</span>[<span class="org-builtin">int</span>, <span class="org-builtin">str</span>] = {1: <span class="org-string">'a'</span>, 2: <span class="org-string">'b'</span>}
d:  <span class="org-variable-name">Set</span>[<span class="org-builtin">str</span>]       = {<span class="org-string">'a'</span>, <span class="org-string">'b'</span>, <span class="org-string">'c'</span>}
e:  <span class="org-variable-name">FrozenSet</span>[<span class="org-builtin">str</span>] = <span class="org-builtin">frozenset</span>({<span class="org-string">'a'</span>, <span class="org-string">'b'</span>, <span class="org-string">'c'</span>})

f1: <span class="org-variable-name">Tuple</span>[<span class="org-builtin">str</span>]           = (<span class="org-string">'a'</span>,)
f2: <span class="org-variable-name">Tuple</span>[<span class="org-builtin">str</span>, <span class="org-builtin">str</span>]      = (<span class="org-string">'a'</span>, <span class="org-string">'b'</span>)
f3: <span class="org-variable-name">Tuple</span>[<span class="org-builtin">str</span>, <span class="org-builtin">str</span>, <span class="org-builtin">str</span>] = (<span class="org-string">'a'</span>, <span class="org-string">'b'</span>, <span class="org-string">'c'</span>)
f4: <span class="org-variable-name">Tuple</span>[<span class="org-builtin">str</span>, ...]      = (<span class="org-string">'a'</span>, <span class="org-string">'b'</span>, <span class="org-string">'c'</span>)

g1: <span class="org-variable-name">Any</span>       = 1
g2: <span class="org-variable-name">Any</span>       = {<span class="org-string">'a'</span>, <span class="org-string">'b'</span>}
g3: <span class="org-variable-name">Any</span>       = {1 : <span class="org-string">'a'</span>, 2 : <span class="org-string">'b'</span>}
g4: <span class="org-variable-name">List</span>[Any] = [1, 2, <span class="org-string">'a'</span>, <span class="org-string">'b'</span>]
</pre>
</div>
</div>
</div>

<div id="outline-container-org82bf031" class="outline-3">
<h3 id="org82bf031"><span class="section-number-3">3.2</span> Understanding <code>Any</code></h3>
<div class="outline-text-3" id="text-3-2">
<p>
<code>Any</code> is a sort of magic type. I like to think of <code>Any</code> as the
type-theoretic counterpart of <code>object</code> in python's class
hierarchy.
</p>

<p>
Every object in python belongs to a class. And every class inherits
methods from other classes. But what happens when we define a base
class (a class that doesn't inherit from other classes)? Even in
that case, python defaults to inheriting from a class called
<code>object</code>. <code>Any</code> is similar. Every type is a subtype of <code>Any</code>, just
as every class inherits from <code>object</code>. (I will have more to say
about subtypes in the later sections).
</p>

<p>
<code>Any</code> is the precise reason why type hints are optional in
python. When the type-checker can't figure out the type of a
variable on its own (and when no type hints are provided by the
user), python simply defaults to usign <code>Any</code> as the variable's type.
</p>
</div>
</div>

<div id="outline-container-org6c311e4" class="outline-3">
<h3 id="org6c311e4"><span class="section-number-3">3.3</span> Optional and Union</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<code>Union</code> represents what in type-theory jargon are called sum-types.
</p>

<p>
One freqently needs the union of a given type with
<code>None</code>. Python's <code>typing</code> module therefore comes with the handy
<code>Optional</code> type-constructor. The following code block illustrates
the use of both of these.
</p>

<div class="org-src-container">
<pre class="src src-python" id="orgf045180"><span class="org-keyword">from</span> typing <span class="org-keyword">import</span> List, Optional, Union

a: List[Union[<span class="org-builtin">int</span>, <span class="org-builtin">str</span>]] = [1, 2, <span class="org-string">'a'</span>, 3, <span class="org-string">'b'</span>]

<span class="org-keyword">def</span> <span class="org-function-name">unsafe_division</span>(a: <span class="org-builtin">int</span>, b: <span class="org-builtin">int</span>) -&gt; Union[<span class="org-builtin">float</span>, <span class="org-type">Exception</span>]:
   <span class="org-doc">"""Divide in an unsafe manner."""</span>
   <span class="org-keyword">if</span> <span class="org-keyword">not</span> b:
       <span class="org-keyword">raise</span> <span class="org-type">ValueError</span>, <span class="org-string">'Field axioms do not allow this.'</span>
   <span class="org-keyword">return</span> a/b

<span class="org-keyword">def</span> <span class="org-function-name">optional_division</span>(a: <span class="org-builtin">int</span>, b: <span class="org-builtin">int</span>) -&gt; Optional[<span class="org-builtin">float</span>]:
   <span class="org-doc">"""Return quotient is b is nonzero, else return None."""</span>
   <span class="org-keyword">return</span> a/b <span class="org-keyword">if</span> b <span class="org-keyword">else</span> <span class="org-constant">None</span>
</pre>
</div>

<p>
Note that one might want to use either the unsafe or the optional
variant of division (depending on the context). Each approach has
its own way of handling the exceptional case. The advantage of using
type hints is that we get a good idea of how the function behaves
just by looking at the call signature of the function!
</p>

<p>
<b>Side note:</b> <code>Exception</code> is an in-built class in python. Almost all
exceptions and errors are inherited from the base class <code>Exception</code>.
(The ones that aren't are inherited from <code>BaseException</code>).
</p>
</div>
</div>
