org/pytype.org
** The =cast= function
   This is a function that lets you do two things:
   - with =cast=, you can resolve ambiguities in the type (in case the typechecker needs some help).
   - you can cheat the typechecker.

  #+NAME: cast
  #+BEGIN_SRC python :results output
  from typing import cast, Union

  def madeup_example(a: Union[int, str]) -> int:
      if hasattr(a, 'split'):
          # must be a string
          a_str = cast(str, a)
          return ord(a_str[0])
      # must be an integer
      a_int = cast(int, a)
      return a_int + 1
  
  print(madeup_example('abc'))
  print(madeup_example(5))
  #+END_SRC

  #+RESULTS: cast
  : 97
  : 6


* TODO Function types
** Call signatures for functions
** Callable
** Map, reduce, filter
** Polymosphism via single-dispatch a.k.a. overloaded functions
* TODO Other special types
** Literal
** Final
** NamedTuple
** Counter
** IO
* TODO Type classes
** Iterator
** Sized
** Generator
** Iterable
** Collection
** AbstractSet
* TODO Generic Types
** Covariant and contravariant types
