pytype.html

<div id="outline-container-org8cb49a4" class="outline-3">
<h3 id="org8cb49a4"><span class="section-number-3">3.4</span> The <code>cast</code> function</h3>
<div class="outline-text-3" id="text-3-4">
<p>
This is a function that lets you do two things:
</p>
<ul class="org-ul">
<li>with <code>cast</code>, you can resolve ambiguities in the type (in case the typechecker needs some help).</li>
<li>you can cheat the typechecker.</li>
</ul>

<div class="org-src-container">
<pre class="src src-python" id="orgec04051"><span class="org-keyword">from</span> typing <span class="org-keyword">import</span> cast, Union

<span class="org-keyword">def</span> <span class="org-function-name">madeup_example</span>(a: Union[<span class="org-builtin">int</span>, <span class="org-builtin">str</span>]) -&gt; <span class="org-builtin">int</span>:
    <span class="org-keyword">if</span> <span class="org-builtin">hasattr</span>(a, <span class="org-string">'split'</span>):
        <span class="org-comment-delimiter"># </span><span class="org-comment">must be a string</span>
        <span class="org-variable-name">a_str</span> = cast(<span class="org-builtin">str</span>, a)
        <span class="org-keyword">return</span> <span class="org-builtin">ord</span>(a_str[0])
    <span class="org-comment-delimiter"># </span><span class="org-comment">must be an integer</span>
    <span class="org-variable-name">a_int</span> = cast(<span class="org-builtin">int</span>, a)
    <span class="org-keyword">return</span> a_int + 1

<span class="org-keyword">print</span>(madeup_example(<span class="org-string">'abc'</span>))
<span class="org-keyword">print</span>(madeup_example(5))
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org3ff5f1b" class="outline-2">
<h2 id="org3ff5f1b"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> Function types</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org8a6394c" class="outline-3">
<h3 id="org8a6394c"><span class="section-number-3">4.1</span> Call signatures for functions</h3>
</div>
<div id="outline-container-org34bc49f" class="outline-3">
<h3 id="org34bc49f"><span class="section-number-3">4.2</span> Callable</h3>
</div>
<div id="outline-container-org71d5ce7" class="outline-3">
<h3 id="org71d5ce7"><span class="section-number-3">4.3</span> Map, reduce, filter</h3>
</div>
<div id="outline-container-org3a866fc" class="outline-3">
<h3 id="org3a866fc"><span class="section-number-3">4.4</span> Polymosphism via single-dispatch a.k.a. overloaded functions</h3>
</div>
</div>
<div id="outline-container-org4026340" class="outline-2">
<h2 id="org4026340"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> Other special types</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org59141d6" class="outline-3">
<h3 id="org59141d6"><span class="section-number-3">5.1</span> Literal</h3>
</div>
<div id="outline-container-org953d2c3" class="outline-3">
<h3 id="org953d2c3"><span class="section-number-3">5.2</span> Final</h3>
</div>
<div id="outline-container-orgb09ea8d" class="outline-3">
<h3 id="orgb09ea8d"><span class="section-number-3">5.3</span> NamedTuple</h3>
</div>
<div id="outline-container-org11162e9" class="outline-3">
<h3 id="org11162e9"><span class="section-number-3">5.4</span> Counter</h3>
</div>
<div id="outline-container-org1ccd043" class="outline-3">
<h3 id="org1ccd043"><span class="section-number-3">5.5</span> IO</h3>
</div>
</div>
<div id="outline-container-org4f87c9a" class="outline-2">
<h2 id="org4f87c9a"><span class="section-number-2">6</span> <span class="todo TODO">TODO</span> Type classes</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org32f6279" class="outline-3">
<h3 id="org32f6279"><span class="section-number-3">6.1</span> Iterator</h3>
</div>
<div id="outline-container-orgb240b28" class="outline-3">
<h3 id="orgb240b28"><span class="section-number-3">6.2</span> Sized</h3>
</div>
<div id="outline-container-orge2f5155" class="outline-3">
<h3 id="orge2f5155"><span class="section-number-3">6.3</span> Generator</h3>
</div>
<div id="outline-container-org772d4bd" class="outline-3">
<h3 id="org772d4bd"><span class="section-number-3">6.4</span> Iterable</h3>
</div>
<div id="outline-container-org17e43b4" class="outline-3">
<h3 id="org17e43b4"><span class="section-number-3">6.5</span> Collection</h3>
</div>
<div id="outline-container-org3c776a7" class="outline-3">
<h3 id="org3c776a7"><span class="section-number-3">6.6</span> AbstractSet</h3>
</div>
</div>
<div id="outline-container-orgf27c2cc" class="outline-2">
<h2 id="orgf27c2cc"><span class="section-number-2">7</span> <span class="todo TODO">TODO</span> Generic Types</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org3d43ff3" class="outline-3">
<h3 id="org3d43ff3"><span class="section-number-3">7.1</span> Covariant and contravariant types</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Vaibhav Karve</p>
<p class="date">Created: 2020-11-22 Sun 22:49</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
